# encoding=utf-8
from encoding_tei import build_tei_object


metrics = []

# 五绝平起首句入韵
metrics.append([
    '1','1','1/0','0','1',
    '1/0','0','0','1','1',
    '1/0','0','1','1','0',
    '1','1','1/0','0','1'])
# 五绝平起首句不入韵
metrics.append([
    '1/0','1','1','0','0',
    '1/0','0','0','1','1',
    '1/0','0','1','1','0',
    '1','1','1/0','0','1'])
# 五绝仄起首句入韵
metrics.append([
    '1/0','0','0','1','1',
    '1','1','1/0','0','1',
    '1/0','1','1','0','0',
    '1/0','0','0','1','1'])
# 五绝仄起首句不入韵
metrics.append([
    '1/0','0','1','1','0',
    '1','1','1/0','0','1',
    '1/0','1','1','0','0',
    '1/0','0','0','1','1'])

root = "data/verse"
build_tei_object([root+"1.raw",root+"2.raw",root+"3.raw",root+"4.raw",root+"5.raw",root+"6.raw",root+"7.raw"],metrics)